# Taps
tap 'homebrew/cask'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'git'
brew 'grep'
brew 'heroku'
brew 'mackup'
brew 'nvm'
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
brew 'zlib' # Needed for Memcached
brew 'stow'
brew 'rbenv'

# Development
brew 'mysql'
brew 'postgresql'
brew 'node'
brew 'redis'
brew 'yarn'
brew 'zsh'
brew 'zsh-completions'

# Apps
cask 'docker'
cask 'github'
cask 'google-chrome'
cask 'iterm2'
cask 'postgres'
cask 'postman'
cask 'spectacle'
cask 'spotify'
cask 'slack'
cask 'microsoft-teams'
cask 'visual-studio-code'
cask 'zoom'
