# Taps
tap 'homebrew/cask'
tap 'homebrew/bundle'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'git'
brew 'grep'
brew 'mackup'
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
brew 'zlib' # Needed for Memcached

# Development
brew 'mysql'
brew 'node'
brew 'redis'
brew 'yarn'
brew 'zsh-completions'

# Apps
cask 'discord'
cask 'docker'
cask 'github'
cask 'google-chrome'
cask 'iterm2'
cask 'postgres'
cask 'postman'
cask 'spotify'
cask 'slack'
cask 'steam'
cask 'sublime-text'
cask 'visual-studio-code'

# Formulae
brew install stow